{
	"_id": {
			"$oid": "5c6b32b531f8d90017c276e1"
	},
	"status": "public",
	"mobileFriendly": "yes",
	"techStack": [
			"React.js + Redux",
			"Bootstrap",
			"Node.js",
			"Express.js",
			"MongoDB"
	],
	"allowComments": true,
	"title": "Gityo Amiibo",
	"desc": "eCommerce",
	"image": "gityo_amiibo.jpg",
	"url": "http://www.gityoamiibo.com",
	"body": "<p>This was my final project for a coding bootcamp called Learning Fuze. It is a production ready eCommerce website that is responsive, visually appealing, and user friendly. React.js combined with Redux enables powerful web applications to run that are faster than many other frameworks. React.js uses JSX for its HTML which means HTML is rendered in Javascript making web site&nbsp;load incredibly fast. In addition, Redux makes data submitting and retrieval very fast and convenient by having a 'store' that keeps a copy of data base information locally. I thought the best way to take advantage of this powerful technology was to create an awesome&nbsp;amiibo store website that&nbsp;'amiibo hunters' can resort to&nbsp;when trying to quell their unsatiable appetite for aesthetically pleasing nintendo collectibles (me being one of them).&nbsp;<\/p><p> <\/p><p>Overall, my final project was very well received by my classmates and the instructors. I was able to take full advantage of Bootstrap's powerful grid system in order to make the website both desktop and mobile friendly. The hardest part during the project was designing the layout so that the website takes full advantage of screen on both desktop and mobile. I often found that when web developers go 'mobile first' (website designed for mobile use first) they often sacrifice a lot of screen space&nbsp;on desktops and end up with a lot of awkard blank spaces. I wanted to focus my design in which scrolling was as minimal as possible so that the web browsing experience was fast and convenient. I also wanted to make sure that adding and removing products from the store for admin users was as fast as possible so that admins can upload dozens of amiibos very quickly without having to load&nbsp;multiple views.&nbsp;<\/p><p> <\/p><p>Please be noted that the site is for demonstration purposes only and no actual sales will occur. That is until I turn 50 and decide to sell my amiibo collection. Then I think I will find an actual use for this website.&nbsp;<\/p>",
	"user": {
			"$oid": "5c6363f8f99ddb001764d373"
	},
	"comments": [],
	"date": {
			"$date": "2019-02-18T22:33:25.116Z"
	},
	"__v": 0
}

6