{
	"_id": {
			"$oid": "5c663900df3c3f2fcc23c746"
	},
	"status": "public",
	"allowComments": true,
	"title": "Help Mario Find the Mushroom!",
	"body": "<p>This was a mini game I made the first week of coding bootcamp at a place called Learning Fuze. It was very well liked by my classmates and the seniors. The idea was to create a simple guessing game. Our instructor made us choose a theme and I knew I had to use&nbsp;Super Mario. I remebered that&nbsp;strange satisfying feeling whenever I made&nbsp;Mario jump&nbsp;headfirst into one of those yellow bricks to reveal what was inside. I tried to recreate that feeling with this game. The objective is to find the good red mushroom and avoid the purple poison mushroom. If you get the red mushroom, you win, and if you get the purple mushroom, you die. What I enjoy the most about this game is the sound the coins make while I'm trying to get to the red mushroom. It is strangely addictive.&nbsp;<\/p><p> <\/p><p>Making this game was very fun and also very straight forward. There was no need for any libraries (except for jQuery), frameworks, or databases for this easy project. The whole game is made with&nbsp;jQuery&nbsp;and the key concept is knowing when to put on and take off the event listeners. If you do not take off the event listeners, it is possible for the same event listeners to stack. This means if you assign an event listener to a DOM and you forget to take off the event listener when resetting the game, the DOM will get assigned the event listener on top of the already existing event listener. This causes problems. For example, when you click the box, the effect would be that two same event listeners for the event trigger causing issues. Other than that, there was nothing else that was particularly tricky. This was a fun mini game to make.&nbsp;<\/p>",
	"user": {
			"$oid": "5c6363f8f99ddb001764d373"
	},
	"comments": [],
	"date": {
			"$date": "2019-02-15T03:58:56.401Z"
	},
	"__v": 25,
	"image": "help_mario_find_the_mushroom.jpg",
	"techStack": [
			"jQuery"
	],
	"url": "https://www.jamesjinpark.com/helpmario",
	"desc": "Game",
	"mobileFriendly": "no"
}

2